/* Выполнить запрос на https://swapi.dev/api/people получить список героев звездных войн.

Вывести каждого героя отдельной карточкой с указанием.
Имени, половой принадлежности, рост, цвет кожи, 
год рождения и планету на которой родился.
            
Создайте кнопку сохранить на каждой карточке.
При нажатии кнопки записшите информацию в браузере
            
        Возможные свойства  :
name строка - Имя этого человека.
            
birth_year строка - Год рождения человека
в соответствии со вселенскими стандартами ДБЯ
или ПБЯ - до битвы при Явине или после битвы при Явине.
Битва при Явине - это битва, которая происходит в конце
эпизода IV «Звездных войн»: Новая надежда.
            
            eye_color строка - Цвет глаз этого человека. Будет "неизвестно", если неизвестно, или "н / д", если у человека нет глаза.
            
gender строка - Пол этого человека. Либо «Мужской»,
«Женский», либо «Неизвестный», «н / д», если у человека
нет пола.
            hair_color строка - Цвет волос этого человека. Будет "неизвестно", если неизвестно, или "н / п", если у человека нет волос.
            
height строка - Рост человека в сантиметрах.
            
            mass строка - Масса человека в килограммах.
            
skin_color строка - Цвет кожи этого человека.
            
homeworld строка - URL ресурса планеты, планеты,
на которой этот человек родился или населяет.
            
            films array - массив URL-адресов киноресурсов, в которых был этот человек.
            species array - массив URL-адресов ресурсов видов, к которым принадлежит этот человек.
            starships array - Массив URL-адресов ресурсов звездолета, которые пилотировал этот человек.
            vehicles array - массив URL-адресов ресурсов транспортного средства, которые пилотировал этот человек.
            url строка - URL-адрес гипермедиа этого ресурса.
            created строка - формат даты ISO 8601 времени создания этого ресурса.
            edited строка - формат даты ISO 8601 времени, когда этот ресурс редактировался.
            
Для создания карточек испозуйте классы*/


//name, birth, gender, heigh, skinColor, homeWorld

const url = 'https://swapi.dev/api/people'

const data = fetch(url)

console.log(data)
